---
kind: type
id: T:Autodesk.Revit.DB.Segment
source: html/8505c96c-1ed1-8c1d-20d7-6661781d0b3c.htm
---
# Autodesk.Revit.DB.Segment

This element represents a segment of an MEP curve object.

## Syntax (C#)
```csharp
public class Segment : Element
```

## Remarks
Currently, only pipe curves can be broken into separate segment elements.